{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 209], "input_dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_21", "activity_regularizer": null, "trainable": true, "filter_length": 15, "init": "he_normal", "bias": true, "nb_filter": 10, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["input_3", 0, 0]]], "name": "convolution1d_21"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_21", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_21", 0, 0]]], "name": "batchnormalization_21"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}, "inbound_nodes": [[["batchnormalization_21", 0, 0]]], "name": "activation_21"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_22", "activity_regularizer": null, "trainable": true, "filter_length": 15, "init": "he_normal", "bias": true, "nb_filter": 10, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_21", 0, 0]]], "name": "convolution1d_22"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_22", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_22", 0, 0]]], "name": "batchnormalization_22"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}, "inbound_nodes": [[["batchnormalization_22", 0, 0]]], "name": "activation_22"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_23", "activity_regularizer": null, "trainable": true, "filter_length": 15, "init": "he_normal", "bias": true, "nb_filter": 10, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_22", 0, 0]]], "name": "convolution1d_23"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_23", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_23", 0, 0]]], "name": "batchnormalization_23"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}, "inbound_nodes": [[["batchnormalization_23", 0, 0]]], "name": "activation_23"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_24", "activity_regularizer": null, "trainable": true, "filter_length": 15, "init": "he_normal", "bias": true, "nb_filter": 10, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_23", 0, 0]]], "name": "convolution1d_24"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_24", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_24", 0, 0]]], "name": "batchnormalization_24"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_24"}, "inbound_nodes": [[["batchnormalization_24", 0, 0]]], "name": "activation_24"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_25", "activity_regularizer": null, "trainable": true, "filter_length": 15, "init": "he_normal", "bias": true, "nb_filter": 10, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_24", 0, 0]]], "name": "convolution1d_25"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_25", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_25", 0, 0]]], "name": "batchnormalization_25"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_25"}, "inbound_nodes": [[["batchnormalization_25", 0, 0]]], "name": "activation_25"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_26", "activity_regularizer": null, "trainable": true, "filter_length": 15, "init": "he_normal", "bias": true, "nb_filter": 10, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_25", 0, 0]]], "name": "convolution1d_26"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_26", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_26", 0, 0]]], "name": "batchnormalization_26"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_26"}, "inbound_nodes": [[["batchnormalization_26", 0, 0]]], "name": "activation_26"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_27", "activity_regularizer": null, "trainable": true, "filter_length": 15, "init": "he_normal", "bias": true, "nb_filter": 10, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_26", 0, 0]]], "name": "convolution1d_27"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_27", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_27", 0, 0]]], "name": "batchnormalization_27"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_27"}, "inbound_nodes": [[["batchnormalization_27", 0, 0]]], "name": "activation_27"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_28", "activity_regularizer": null, "trainable": true, "filter_length": 15, "init": "he_normal", "bias": true, "nb_filter": 10, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_27", 0, 0]]], "name": "convolution1d_28"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_28", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_28", 0, 0]]], "name": "batchnormalization_28"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_28"}, "inbound_nodes": [[["batchnormalization_28", 0, 0]]], "name": "activation_28"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_29", "activity_regularizer": null, "trainable": true, "filter_length": 15, "init": "he_normal", "bias": true, "nb_filter": 10, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_28", 0, 0]]], "name": "convolution1d_29"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_29", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_29", 0, 0]]], "name": "batchnormalization_29"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_29"}, "inbound_nodes": [[["batchnormalization_29", 0, 0]]], "name": "activation_29"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_30", "activity_regularizer": null, "trainable": true, "filter_length": 15, "init": "he_normal", "bias": true, "nb_filter": 10, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_29", 0, 0]]], "name": "convolution1d_30"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_30", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_30", 0, 0]]], "name": "batchnormalization_30"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_30"}, "inbound_nodes": [[["batchnormalization_30", 0, 0]]], "name": "activation_30"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "local_start_conv", "activity_regularizer": null, "trainable": true, "filter_length": 15, "init": "he_normal", "bias": true, "nb_filter": 1, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_30", 0, 0]]], "name": "local_start_conv"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "local_start_nor", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["local_start_conv", 0, 0]]], "name": "local_start_nor"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "local_start_acti"}, "inbound_nodes": [[["local_start_nor", 0, 0]]], "name": "local_start_acti"}], "input_layers": [["input_3", 0, 0]], "output_layers": [["local_start_acti", 0, 0]], "name": "model_3"}}